# Core utilities
zsh
zsh-autosuggestions
zsh-syntax-highlighting
stow
tmux
neovim
ripgrep
fd-find
fzf
bat
htop
unzip

# Python build dependencies
libssl-dev
zlib1g-dev
libbz2-dev
libreadline-dev
libsqlite3-dev
libncursesw5-dev
xz-utils
tk-dev
libxml2-dev
libxmlsec1-dev
libffi-dev
liblzma-dev

# Fonts and terminal
fontconfig
